#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mar 14 22:43:32 2023

@author: ziyinlin
"""

"""
1.請修正下列程式碼，使其能正確執行： 
>>>
bornYear = input("請輸入你的出生年份：")
nowYear = input("請輸入今年的年份：")
age = nowYear - bornYear
print("你今年%d歲" % age)
"""
#======================第一題============================





#========================================================


"""
2.金融卡完整卡號是16碼， 但不是每間銀行的帳號長度都會達16碼，
當未達16碼時，前面須補上0。
試著寫一段程式碼，請輸入你的學號，最後會輸出16位的整數。
"""
#=======================第二題============================





#========================================================

"""
3.個別輸入當天的年份、月份及日期，再以格式化方式輸出。
然後程式再輸出2023/03/17。
"""
#=======================第三題============================





#========================================================

"""
4.請輸出以下詩 並利用"\t"與"\n"
>>>
詩名：下江陵              作者：李白


朝辭白帝彩雲間 	　千里江陵一日還
兩岸猿聲啼不住	　    輕舟已過萬重山

>>>
"""

#=======================第四題============================





#========================================================

"""
5.已知字串 list = 「ambe1rwest3ydog4bgs7Dlsf9eAF」,
將字串中的數位取出，生成一個新的字串
提示
# 1. 要想提取數位字元，我們需要遍歷字串
# 2. 需要知道如何判斷一個字元是否是數位,數位是有0123456789 中的字元構成，
如果字元在這裡面是不是就表示這個是數位
# 3. 把是數位的字元拼接到一起

"""
#=======================第五題============================





#========================================================

"""
6.輸入成績，判斷是屬於哪個水平，將結果列印出來。
60以下不及格，60分以上為及格，70至90分為良好，90分以上為優秀。
"""
#=======================第陸題============================





#========================================================

"""
7.lst = [1, 2, 3, 4, 5, 6, 7, 8],刪除列表中的奇數
"""
#=======================第柒題============================





#========================================================